Bismuth208/STMGPU/STM32_Project/Drivers/gfx_tft/gfx.c
/*
This is the core graphics library for all our displays, providing a common
set of graphics primitives (points, lines, circles, etc.).  It needs to be
paired with a hardware-specific library for each display device we carry
(to handle the lower-level functions).

Adafruit invests time and resources providing this open source code, please
support Adafruit & open-source hardware by purchasing products from Adafruit!

Copyright (c) 2013 Adafruit Industries.  All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

- Redistributions of source code must retain the above copyright notice,
this list of conditions and the following disclaimer.
- Redistributions in binary form must reproduce the above copyright notice,
this list of conditions and the following disclaimer in the documentation
and/or other materials provided with the distribution.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.
*/

#ifdef __AVR__
#include <avr/pgmspace.h>
#else
#define pgm_read_byte(addr) (*(const unsigned char *)(addr))
#define strlen_P strlen

#include <stm32f10x.h>
#include <stm32f10x_dma.h>
#endif

#include <string.h>
#include <stdbool.h>
#include <stdlib.h>

#include <systicktimer.h>

#ifdef __AVR__
#include <avrspi.h>
#else
#include <spi.h>
#endif

#include "gfx.h"
#include "glcdfont.h"

#if USE_DMA
#include "gfxDMA.h"
#endif

//-------------------------------------------------------------------------------------------//

#ifndef min
#define min(a,b) ((a < b) ? a : b)
#endif

#ifndef sign
#define sign(x) ((x)>0?(1):-(1))
#endif

#ifndef abs
#define abs(x) ((x)>0?(x):-(x))
#endif

#ifndef swap
#define swap(a, b) { int16_t t = a; a = b; b = t; }
#endif

//-------------------------------------------------------------------------------------------//

static uint8_t textsize = 1;
//static uint8_t rotation = 0;

static uint16_t textcolor   = COLOR_WHITE;
static uint16_t textbgcolor = COLOR_WHITE;

static int16_t cursor_x = 0;
static int16_t cursor_y = 0;

static bool wrap = true;   // If set, 'wrap' text at right edge of display
static bool _cp437 = false; // If set, use correct CP437 charset (default is off)


#if USE_DMA
uint16_t charBuffer[192]; // size == 5
#endif

//-------------------------------------------------------------------------------------------//

void drawCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color)
{
  int16_t x = -r, y = 0, err = 2-2*r, e2;
  
  do {
    tftDrawPixel(x0-x, y0+y, color);
    tftDrawPixel(x0+x, y0+y, color);
    tftDrawPixel(x0+x, y0-y, color);
    tftDrawPixel(x0-x, y0-y, color);
    
    e2 = err;
    if (e2 <= y) {
      err += ++y*2+1;
      if ((-x == y) && (e2 <= x)) e2 = 0;
    }
    if (e2 > x) err += ++x*2+1;
  } while (x <= 0);
}

#if 0
void fillCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color)
{
  int16_t x = -r, y = 0, err = 2-2*r, e2;
  
  do {
    //vline(x0-x, y0-y, y0+y, color);
    //vline(x0+x, y0-y, y0+y, color);
    tftDrawFastVLine(x0-x, y0-y, y0+y, color);
    tftDrawFastVLine(x0+x, y0-y, y0+y, color);
    e2 = err;
    if (e2 <= y) {
      err += ++y*2+1;
      if (-x == y && e2 <= x) e2 = 0;
    }
    if (e2 > x) err += ++x*2+1;
  } while (x <= 0);
}
#endif

#if 1
void fillCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color)
{
  tftDrawFastVLine(x0, y0-r, 2*r+1, color);
  fillCircleHelper(x0, y0, r, 3, 0, color);
}
#endif

void drawCircleHelper( int16_t x0, int16_t y0, int16_t r, uint8_t cornername, uint16_t color)
{
  int16_t f     = 1 - r;
  int16_t ddF_x = 1;
  int16_t ddF_y = -2 * r;
  int16_t x     = 0;
  int16_t y     = r;
  
  while (x<y) {
    if (f >= 0) {
      y--;
      ddF_y += 2;
      f     += ddF_y;
    }
    x++;
    ddF_x += 2;
    f     += ddF_x;
    if (cornername & 0x4) {
      tftDrawPixel(x0 + x, y0 + y, color);
      tftDrawPixel(x0 + y, y0 + x, color);
    } 
    if (cornername & 0x2) {
      tftDrawPixel(x0 + x, y0 - y, color);
      tftDrawPixel(x0 + y, y0 - x, color);
    }
    if (cornername & 0x8) {
      tftDrawPixel(x0 - y, y0 + x, color);
      tftDrawPixel(x0 - x, y0 + y, color);
    }
    if (cornername & 0x1) {
      tftDrawPixel(x0 - y, y0 - x, color);
      tftDrawPixel(x0 - x, y0 - y, color);
    }
  }
}

// Used to do circles and roundrects
void fillCircleHelper(int16_t x0, int16_t y0, int16_t r, uint8_t cornername, int16_t delta, uint16_t color)
{
  int16_t f     = 1 - r;
  int16_t ddF_x = 1;
  int16_t ddF_y = -2 * r;
  int16_t x     = 0;
  int16_t y     = r;
  
  while (x<y) {
    if (f >= 0) {
      y--;
      ddF_y += 2;
      f     += ddF_y;
    }
    x++;
    ddF_x += 2;
    f     += ddF_x;
    
    if (cornername & 0x1) {
      tftDrawFastVLine(x0+x, y0-y, 2*y+1+delta, color);
      tftDrawFastVLine(x0+y, y0-x, 2*x+1+delta, color);
    }
    if (cornername & 0x2) {
      tftDrawFastVLine(x0-x, y0-y, 2*y+1+delta, color);
      tftDrawFastVLine(x0-y, y0-x, 2*x+1+delta, color);
    }
  }
}

// Bresenham's algorithm
void tftDrawLine(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color)
{
  if (y0 == y1) {
    if (x1 > x0) {
      tftDrawFastHLine(x0, y0, x1 - x0 + 1, color);
    } else if (x1 < x0) {
      tftDrawFastHLine(x1, y0, x0 - x1 + 1, color);
    } else {
      tftDrawPixel(x0, y0, color);
    }
    return;
  } else if (x0 == x1) {
    if (y1 > y0) {
      tftDrawFastVLine(x0, y0, y1 - y0 + 1, color);
    } else {
      tftDrawFastVLine(x0, y1, y0 - y1 + 1, color);
    }
    return;
  }
  
