Bismuth208/STMGPU/STM32_Project/Drivers/gfx_tft/gfx.c
  bool steep = abs(y1 - y0) > abs(x1 - x0);
  
  if (steep) {
    swap(x0, y0);
    swap(x1, y1);
  }
  
  if (x0 > x1) {
    swap(x0, x1);
    swap(y0, y1);
  }
  
  int16_t dx = x1 - x0;
  int16_t dy = abs(y1 - y0);
  
  int16_t err = dx / 2;
  int16_t ystep;
  
  int16_t xbegin = x0;
  int16_t len;
  
  if (y0 < y1) {
    ystep = 1;
  } else {
    ystep = -1;
  }
    
  if (steep) {
    for (; x0<=x1; x0++) {
      err -= dy;
      if (err < 0) {
        len = x0 - xbegin;
        if (len) {
          tftDrawFastVLine(y0, xbegin, len + 1, color);
        } else {
          tftDrawPixel(y0, x0, color);
        }
        xbegin = x0 + 1;
        y0 += ystep;
        err += dx;
      }
    }
    if (x0 > xbegin + 1) {
      tftDrawFastVLine(y0, xbegin, x0 - xbegin, color);
    }
    
  } else {
    for (; x0<=x1; x0++) {
      err -= dy;
      if (err < 0) {
        len = x0 - xbegin;
        if (len) {
          tftDrawFastHLine(xbegin, y0, len + 1, color);
        } else {
          tftDrawPixel(x0, y0, color);
        }
        xbegin = x0 + 1;
        y0 += ystep;
        err += dx;
      }
    }
    if (x0 > xbegin + 1) {
      tftDrawFastHLine(xbegin, y0, x0 - xbegin, color);
    }
  }
  
}

// Draw a rectangle
void tftDrawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{  
  tftDrawFastHLine(x, y, w, color);
  tftDrawFastHLine(x, y+h-1, w, color);
  tftDrawFastVLine(x, y, h, color);
  tftDrawFastVLine(x+w-1, y, h, color);
}

void tftFillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{
  // rudimentary clipping (drawChar w/big text requires this)
  if((x >= _width) || (y >= _height)) return;
  if((x + w - 1) >= _width)  w = _width  - x;
  if((y + h - 1) >= _height) h = _height - y;
  
  tftSetAddrWindow(x, y, x+w-1, y+h-1);
  
#if USE_DMA
  fillColor_DMA1_SPI1(w*h, color);
  //SET_TFT_CS_HI;
#else
  
  //SET_TFT_DC_HI;
  //SET_TFT_CS_LOW;
#if USE_FSMC
  for(y=h; y>0; y--) {
    for(x=w; x>0; x--) {
      FSMC_SEND_DATA(color);
    }
  }
#else
  repeatData16_SPI1(color, w*h,);
#endif // USE_FSMC
  RELEASE_TFT();
  
#endif // USE_DMA
}

// Draw a rounded rectangle
void drawRoundRect(int16_t x, int16_t y, int16_t w, int16_t h, int16_t r, uint16_t color)
{
  // smarter version
  tftDrawFastHLine(x+r  , y    , w-2*r, color); // Top
  tftDrawFastHLine(x+r  , y+h-1, w-2*r, color); // Bottom
  tftDrawFastVLine(x    , y+r  , h-2*r, color); // Left
  tftDrawFastVLine(x+w-1, y+r  , h-2*r, color); // Right
  // draw four corners
  drawCircleHelper(x+r    , y+r    , r, 1, color);
  drawCircleHelper(x+w-r-1, y+r    , r, 2, color);
  drawCircleHelper(x+w-r-1, y+h-r-1, r, 4, color);
  drawCircleHelper(x+r    , y+h-r-1, r, 8, color);
}

// Fill a rounded rectangle
void fillRoundRect(int16_t x, int16_t y, int16_t w, int16_t h, int16_t r, uint16_t color)
{
  // smarter version
  tftFillRect(x+r, y, w-2*r, h, color);
  
  // draw four corners
  fillCircleHelper(x+w-r-1, y+r, r, 1, h-2*r-1, color);
  fillCircleHelper(x+r    , y+r, r, 2, h-2*r-1, color);
}

// Draw a triangle
void drawTriangle(int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color)
{
  tftDrawLine(x0, y0, x1, y1, color);
  tftDrawLine(x1, y1, x2, y2, color);
  tftDrawLine(x2, y2, x0, y0, color);
}

// Fill a triangle
void fillTriangle ( int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color)
{
  int16_t a, b, y, last;
  
  // Sort coordinates by Y order (y2 >= y1 >= y0)
  if (y0 > y1) {
    swap(y0, y1); swap(x0, x1);
  }
  if (y1 > y2) {
    swap(y2, y1); swap(x2, x1);
  }
  if (y0 > y1) {
    swap(y0, y1); swap(x0, x1);
  }
  
  if(y0 == y2) { // Handle awkward all-on-same-line case as its own thing
    a = b = x0;
    if(x1 < a)      a = x1;
    else if(x1 > b) b = x1;
    if(x2 < a)      a = x2;
    else if(x2 > b) b = x2;
    tftDrawFastHLine(a, y0, b-a+1, color);
    return;
  }
  
  int16_t
    dx01 = x1 - x0,
    dy01 = y1 - y0,
    dx02 = x2 - x0,
    dy02 = y2 - y0,
    dx12 = x2 - x1,
    dy12 = y2 - y1;
  int32_t
    sa   = 0,
    sb   = 0;
  
  // For upper part of triangle, find scanline crossings for segments
  // 0-1 and 0-2.  If y1=y2 (flat-bottomed triangle), the scanline y1
  // is included here (and second loop will be skipped, avoiding a /0
  // error there), otherwise scanline y1 is skipped here and handled
  // in the second loop...which also avoids a /0 error here if y0=y1
  // (flat-topped triangle).
  if(y1 == y2) last = y1;   // Include y1 scanline
  else         last = y1-1; // Skip it
  
  for(y=y0; y<=last; y++) {
    a   = x0 + sa / dy01;
    b   = x0 + sb / dy02;
    sa += dx01;
    sb += dx02;
    /* longhand:
    a = x0 + (x1 - x0) * (y - y0) / (y1 - y0);
    b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
    */
    if(a > b) swap(a,b);
    tftDrawFastHLine(a, y, b-a+1, color);
  }
  
  // For lower part of triangle, find scanline crossings for segments
  // 0-2 and 1-2.  This loop is skipped if y1=y2.
  sa = dx12 * (y - y1);
  sb = dx02 * (y - y0);
  for(; y<=y2; y++) {
    a   = x1 + sa / dy12;
    b   = x0 + sb / dy02;
    sa += dx12;
    sb += dx02;
    /* longhand:
    a = x1 + (x2 - x1) * (y - y1) / (y2 - y1);
    b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
    */
    if(a > b) swap(a,b);
    tftDrawFastHLine(a, y, b-a+1, color);
  }
}

void drawBitmap(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t color)
{
  int16_t i, j, byteWidth = (w + 7) / 8;
  
  for(j=0; j<h; j++) {
    for(i=0; i<w; i++ ) {
      if(pgm_read_byte(bitmap + j * byteWidth + i / 8) & (128 >> (i & 7))) {
        tftDrawPixel(x+i, y+j, color);
      }
    }
  }
}

// Draw a 1-bit color bitmap at the specified x, y position from the
// provided bitmap buffer (must be PROGMEM memory) using color as the
// foreground color and bg as the background color.
void drawBitmapBG(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t color, uint16_t bg)
{
  int16_t i, j, byteWidth = (w + 7) / 8;
  
