Bismuth208/STMGPU/STM32_Project/Drivers/gfx_tft/gfx.c
  for(j=0; j<h; j++) {
    for(i=0; i<w; i++ ) {
      if(pgm_read_byte(bitmap + j * byteWidth + i / 8) & (128 >> (i & 7))) {
        tftDrawPixel(x+i, y+j, color);
      } else {
      	tftDrawPixel(x+i, y+j, bg);
      }
    }
  }
}

//Draw XBitMap Files (*.xbm), exported from GIMP,
//Usage: Export from GIMP to *.xbm, rename *.xbm to *.c and open in editor.
//C Array can be directly used with this function
void drawXBitmap(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t color)
{
  int16_t i, j, byteWidth = (w + 7) / 8;
  
  for(j=0; j<h; j++) {
    for(i=0; i<w; i++ ) {
      if(pgm_read_byte(bitmap + j * byteWidth + i / 8) & (1 << (i % 8))) {
        tftDrawPixel(x+i, y+j, color);
      }
    }
  }
}

//=================================== Print section ========================//
void print(const char *str)
{
  uint16_t size = strlen(str);
  
  while (size--) {
    printChar(*(const uint8_t *)str++);
  }
}
/*
void print(const char *str)
{
const uint8_t *buffer = (const uint8_t *)str;
size_t size = strlen(str);

while (size--) {
printChar(*buffer++);
  }
}
*/

void printCharPos(int16_t x, int16_t y, uint8_t c)
{
  setCursor(x, y);
  printChar(c);
}

void tftPrintPGR(const char *str)
{
  for(uint16_t count=0; count < strlen_P(str); count++)
    printChar(pgm_read_byte(str + count));
}

void printChar(uint8_t c)
{
  if (c == '\n') {
    cursor_y += textsize*8;
    cursor_x  = 0;
  } else if (c == '\r') {
    // skip em
  } else {
    drawChar(cursor_x, cursor_y, c, textcolor, textbgcolor, textsize);
    cursor_x += textsize*6;
    if (wrap && (cursor_y > (_height - textsize*8))) {
      cursor_y = 0;
      cursor_x += textsize*5;
    }
    if (wrap && (cursor_x > (_width - textsize*6))) {
      cursor_y += textsize*8;
      cursor_x = 0;
    }
    
  }
}

#if 0 // work on avr;
void drawChar(int16_t x, int16_t y, uint8_t c, uint16_t color, uint16_t bg, uint8_t size)
{
  if((x >= _width)            || // Clip right
     (y >= _height)           || // Clip bottom
       ((x + 6 * size - 1) < 0) || // Clip left
         ((y + 8 * size - 1) < 0))   // Clip top
    return;
  
  if(!_cp437 && (c >= 176)) c++; // Handle 'classic' charset behavior
  
  uint8_t line;
  int8_t i, j;
  
  
  if(size == 1) {
    for (i=0; i<6; i++ ) {
      
      if (i == 5)
        line = 0x0;
      else
        line = pgm_read_byte(font+(c*5)+i);
      
      for (j = 0; j<8; j++) {
        if (line & 0x1) tftDrawPixel(x+i, y+j, color);
        else if (bg != color) {
          tftDrawPixel(x+i, y+j, bg);
        }
        line >>= 1;
      }
    }
  } else {
    for (i=0; i<6; i++ ) {
      
      if (i == 5)
        line = 0x0;
      else
        line = pgm_read_byte(font+(c*5)+i);
      
      for (j = 0; j<8; j++) {
        if (line & 0x1) {
          tftFillRect(x+(i*size), y+(j*size), size, size, color);
        } else if (bg != color) {
          tftFillRect(x+i*size, y+j*size, size, size, bg);
        }
        line >>= 1;
      }
    }
  }
}
#endif

#if 1 // Experimental; work only on stm
// Draw a character
void drawChar(int16_t x, int16_t y, uint8_t c, uint16_t fgcolor, uint16_t bgcolor, uint8_t size)
{
  if(!_cp437 && (c >= 176)) c++; // Handle 'classic' charset behavior
  
  if (fgcolor == bgcolor) {
    uint8_t mask = 0x01;
    int16_t xoff, yoff;
    
    // This transparent approach is only about 20% faster
    // Don't need to clip here since the called rendering primitives all clip
    if (size == 1) {
      for (yoff=0; yoff < 8; yoff++) {
        uint8_t line = 0;
        for (xoff=0; xoff < 5; xoff++) {
          if (font[c * 5 + xoff] & mask) line |= 1;
          line <<= 1;
        }
        line >>= 1;
        xoff = 0;
        while (line) {
          if (line == 0x1F) {
            tftDrawFastHLine(x + xoff, y + yoff, 5, fgcolor);
            break;
          } else if (line == 0x1E) {
            tftDrawFastHLine(x + xoff, y + yoff, 4, fgcolor);
            break;
          } else if ((line & 0x1C) == 0x1C) {
            tftDrawFastHLine(x + xoff, y + yoff, 3, fgcolor);
            line <<= 4;
            xoff += 4;
          } else if ((line & 0x18) == 0x18) {
            tftDrawFastHLine(x + xoff, y + yoff, 2, fgcolor);
            line <<= 3;
            xoff += 3;
          } else if ((line & 0x10) == 0x10) {
            tftDrawPixel(x + xoff, y + yoff, fgcolor);
            line <<= 2;
            xoff += 2;
          } else {
            line <<= 1;
            xoff += 1;
          }
        }
        mask = mask << 1;
      }
    } else {
      for (yoff=0; yoff < 8; yoff++) {
        uint8_t line = 0;
        for (xoff=0; xoff < 5; xoff++) {
          if (font[c * 5 + xoff] & mask) line |= 1;
          line <<= 1;
        }
        line >>= 1;
        xoff = 0;
        while (line) {
          if (line == 0x1F) {
            tftFillRect(x + xoff * size, y + yoff * size,
                        5 * size, size, fgcolor);
            break;
          } else if (line == 0x1E) {
            tftFillRect(x + xoff * size, y + yoff * size,
                        4 * size, size, fgcolor);
            break;
          } else if ((line & 0x1C) == 0x1C) {
            tftFillRect(x + xoff * size, y + yoff * size,
                        3 * size, size, fgcolor);
            line <<= 4;
            xoff += 4;
          } else if ((line & 0x18) == 0x18) {
            tftFillRect(x + xoff * size, y + yoff * size,
                        2 * size, size, fgcolor);
            line <<= 3;
            xoff += 3;
          } else if ((line & 0x10) == 0x10) {
            tftFillRect(x + xoff * size, y + yoff * size,
                        size, size, fgcolor);
            line <<= 2;
            xoff += 2;
          } else {
            line <<= 1;
            xoff += 1;
          }
        }
        mask = mask << 1;
      }
    }
  } else {
    // Rudimentary clipping
    if((x >= _width)            || // Clip right
       (y >= _height)           || // Clip bottom
         ((x + 6 * size - 1) < 0) || // Clip left  TODO: this is not correct
           ((y + 8 * size - 1) < 0))   // Clip top   TODO: this is not correct
      return;
    
    // This solid background approach is about 5 time faster
    tftSetAddrWindow(x, y, x + 6 * size - 1, y + 8 * size - 1);
    
    uint8_t xr, yr;
    uint8_t mask = 0x01;
    uint16_t color;
    
#if USE_DMA    
    uint8_t bufCount = 0;
#endif
    
