Bismuth208/STMGPU/STM32_Project/Drivers/gfx_tft/gfx.c
    for (y=0; y < 8; y++) {
      for (yr=0; yr < size; yr++) {
        for (x=0; x < 5; x++) {
          if (font[c * 5 + x] & mask) {
            color = fgcolor;
          } else {
            color = bgcolor;
          }
          for (xr=0; xr < size; xr++) {
#if USE_DMA
            charBuffer[bufCount++] = color;
#else
#if USE_FSMC
            FSMC_SEND_DATA(color);
#else
            sendData16_SPI1(color);
#endif // USE_FSMC
#endif // USE_DMA
          }
        }
        for (xr=0; xr < size; xr++) {
#if USE_DMA
          charBuffer[bufCount++] = bgcolor;
#else
#if USE_FSMC
          FSMC_SEND_DATA(bgcolor);
#else
          sendData16_SPI1(bgcolor);
#endif // USE_FSMC
#endif // USE_DMA
        }
      }
      mask = mask << 1;
    }
#if USE_DMA
    bufCount++;
    
    sendData16_DMA1_SPI1(bufCount, charBuffer);
#endif    
  }
}
#endif

uint16_t columns()
{
  return (width() / (textsize*6));
}

uint16_t rows()
{
  return (height() / (textsize*8));
}
/*
void setFont(unsigned char* f)
{
font = f;
}
*/
void setCursor(int16_t x, int16_t y)
{
  cursor_x = x;
  cursor_y = y;
}

int16_t getCursorX(void)
{
  return cursor_x;
}

int16_t getCursorY(void)
{
  return cursor_y;
}

void setTextSize(uint8_t s)
{
  textsize = (s > 0) ? s : 1;
}

void setTextColor(uint16_t c)
{
  // For 'transparent' background, we'll set the bg 
  // to the same as fg instead of using a flag
  textcolor = textbgcolor = c;
}

void setTextColorBG(uint16_t c, uint16_t b)
{
  textcolor   = c;
  textbgcolor = b; 
}

void setTextWrap(bool w)
{
  wrap = w;
}
//==========================================================================//

// Enable (or disable) Code Page 437-compatible charset.
// There was an error in glcdfont.c for the longest time -- one character
// (#176, the 'light shade' block) was missing -- this threw off the index
// of every character that followed it.  But a TON of code has been written
// with the erroneous character indices.  By default, the library uses the
// original 'wrong' behavior and old sketches will still work.  Pass 'true'
// to this function to use correct CP437 character values in your code.
void cp437(bool x) {
  _cp437 = x;
}

// Return the size of the display (per current rotation)
int16_t width(void)
{
  return _width;
}

int16_t height(void)
{
  return _height;
}

/***************************************************************************/

void tftPushColor(uint16_t color)
{
#if USE_FSMC
  FSMC_SEND_DATA(color);
#else
  //SET_TFT_DC_HI;
  //SET_TFT_CS_LOW;
  
  sendData16_SPI1(color);
  
  //SET_TFT_CS_HI;
#endif // USE_FSMC  
}

void tftDrawPixel(int16_t x, int16_t y, uint16_t color)
{
  if((x < 0) || (x >= _width) || (y < 0) || (y >= _height)) return;
  
  //tftSetAddrWindow(x,y,x,y);
  tftSetAddrPixel(x, y);

#if USE_FSMC
  *FSMC_SEND_DATA(color);
#else
  //SET_TFT_DC_HI;
  //SET_TFT_CS_LOW;
  
  sendData16_SPI1(color);
  RELEASE_TFT();
#endif // USE_FSMC
}

void tftDrawFastVLine(int16_t x, int16_t y, int16_t h, uint16_t color)
{
  // Rudimentary clipping
  if((x >= _width) || (y >= _height)) return;
  if((y+h-1) >= _height) h = _height-y;
  
  //tftSetAddrWindow(x, y, x, y+h-1);
  tftSetVAddrWindow(x, y, y+h-1);
  
  //SET_TFT_DC_HI;
  //SET_TFT_CS_LOW;
  
#if USE_DMA
  fillColor_DMA1_SPI1(h, color);
  //SET_TFT_CS_HI;
#else
#if USE_FSMC
  while (h--) {
    FSMC_SEND_DATA(color);
  }
#else
  repeatData16_SPI1(color, h);
#endif // USE_FSMC
  RELEASE_TFT();
#endif // USE_DMA
  
}

void tftDrawFastHLine(int16_t x, int16_t y, int16_t w, uint16_t color)
{
  // Rudimentary clipping
  if((x >= _width) || (y >= _height)) return;
  if((x+w-1) >= _width)  w = _width-x;
  
  //tftSetAddrWindow(x, y, x+w-1, y);
  tftSetHAddrWindow(x, y, x+w-1);
  
  //SET_TFT_DC_HI;
  //SET_TFT_CS_LOW;
  
#if USE_DMA
  fillColor_DMA1_SPI1(w, color);
  //SET_TFT_CS_HI;
#else
#if USE_FSMC
  while (w--) {
    FSMC_SEND_DATA(color);
  }
#else
  repeatData16_SPI1(color, w);
#endif // USE_FSMC
  RELEASE_TFT();
#endif // USE_DMA
  
}

void tftFillScreen(uint16_t color)
{
#if USE_DMA
  tftSetAddrWindow(0, 0, _width-1, _height-1);
  
  fillColor_DMA1_SPI1(_width * _height, color);
  
#else
  
  tftFillRect(0, 0,  _width, _height, color);
#endif 
}

// Pass 8-bit (each) R,G,B, get back 16-bit packed color
uint16_t color565(uint8_t r, uint8_t g, uint8_t b)
{
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

// converts rgb 332 to rgb 565
uint16_t conv8to16(uint8_t x)
{
  uint16_t r, g, b;
  r = x>>5;
  g = (x&0x1c)>2;
  b = x&0x03;
  return (((r<<13) + (r<<10))&0xf800) + (g<<8) + (g<<5) + (b<<3) + (b<<1) + (b>>1);
}

/*
uint8_t getRotation(void)
{
return rotation;
}
*/
